johofz/Reflow_Oven_V2/Firmware/F415VG/F415VG.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F4
PD7.Mode=NorPsramChipSelect1_1
ProjectManager.MainLocation=Core/Src
PB13.GPIOParameters=GPIO_Label
PA6.Mode=Full_Duplex_Master
USB_DEVICE.CLASS_NAME_FS=CDC
PH0-OSC_IN.Signal=RCC_OSC_IN
RCC.CortexFreq_Value=168000000
SPI3.Direction=SPI_DIRECTION_2LINES
SPI3.VirtualType=VM_MASTER
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F415VGTx
SPI1.VirtualType=VM_MASTER
NVIC.TIM6_DAC_IRQn=true\:0\:0\:false\:false\:true\:true\:true
PB4.GPIO_ModeDefaultEXTI=GPIO_MODE_IT_FALLING
RCC.PLLCLKFreq_Value=168000000
PC10.Signal=SPI3_SCK
PC12.Signal=SPI3_MOSI
PB14.GPIO_Label=SD_CS
RCC.PLLQCLKFreq_Value=48000000
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_FSMC_Init-FSMC-false-HAL-true,4-MX_USB_DEVICE_Init-USB_DEVICE-false-HAL-false,5-MX_SPI1_Init-SPI1-false-HAL-true,6-MX_SPI3_Init-SPI3-false-HAL-true,7-MX_TIM2_Init-TIM2-false-HAL-true
PA11.Mode=Device_Only
RCC.RTCFreq_Value=32000
PB6.GPIO_Label=LIGHT
USB_DEVICE.VirtualMode-CDC_FS=Cdc
PB13.GPIO_Label=FLASH_CS
PB13.Signal=GPIO_Output
PB15.Signal=GPIO_Output
PD9.Mode=16b-d1
PinOutPanel.RotationAngle=0
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x400
PB5.GPIOParameters=GPIO_Label
Mcu.IP4=SPI3
RCC.FCLKCortexFreq_Value=168000000
Mcu.IP5=SYS
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP2=RCC
Mcu.IP3=SPI1
PB4.GPIOParameters=GPIO_Label,GPIO_ModeDefaultEXTI
Mcu.IP0=FSMC
Mcu.IP1=NVIC
PA12.Signal=USB_OTG_FS_DP
PE11.Mode=16b-d1
Mcu.UserConstants=
Mcu.ThirdPartyNb=0
SPI1.Direction=SPI_DIRECTION_2LINES
RCC.HCLKFreq_Value=168000000
Mcu.IPNb=12
RCC.I2SClocksFreq_Value=192000000
TIM2.IPParameters=Period,Prescaler
ProjectManager.PreviousToolchain=
PD4.Signal=FSMC_NOE
RCC.APB2TimFreq_Value=168000000
PB6.Signal=GPIO_Output
RCC.VcooutputI2S=192000000
SPI1.CalculateBaudRate=2.625 MBits/s
PD10.Mode=16b-d1
Mcu.Pin6=PE7
PD0.Signal=FSMC_D2
Mcu.Pin7=PE8
PD8.Signal=FSMC_D13
VP_TIM2_VS_ClockSourceINT.Signal=TIM2_VS_ClockSourceINT
Mcu.Pin8=PE9
Mcu.Pin9=PE10
RCC.AHBFreq_Value=168000000
PH0-OSC_IN.Mode=HSE-External-Oscillator
PB13.Locked=true
Mcu.Pin0=PH0-OSC_IN
PD5.Mode=Lcd1
Mcu.Pin1=PH1-OSC_OUT
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PA4
Mcu.Pin3=PA5
Mcu.Pin4=PA6
Mcu.Pin5=PA7
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=16000000
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PB3.Mode=Trace_Asynchronous_SW
PA4.Locked=true
Mcu.IP10=USB_DEVICE
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
SH.GPXTI12.0=GPIO_EXTI12
Mcu.IP11=USB_OTG_FS
PB12.GPIO_Label=TOUCH_IQR
ProjectManager.FirmwarePackage=STM32Cube FW_F4 V1.26.0
MxDb.Version=DB.6.0.20
PE13.Signal=FSMC_D10
ProjectManager.BackupPrevious=false
RCC.VCOInputFreq_Value=2000000
PE9.Signal=FSMC_D6
PA14.Mode=Trace_Asynchronous_SW
PD14.Mode=16b-d1
TIM3.Prescaler=84 - 1
NVIC.TIM2_IRQn=true\:0\:0\:false\:false\:true\:true\:true
File.Version=6
PB7.Signal=GPIO_Output
PE13.Mode=16b-d1
PB6.Locked=true
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PE10.Signal=FSMC_D7
PB6.GPIOParameters=GPIO_Label
ProjectManager.HalAssertFull=false
ProjectManager.ProjectName=F415VG
PD15.Mode=16b-d1
PH1-OSC_OUT.Mode=HSE-External-Oscillator
PB7.GPIO_Label=FAN
RCC.MCO2PinFreq_Value=168000000
Mcu.Package=LQFP100
TIM2.Prescaler=84 - 1
PA6.Signal=SPI1_MISO
SPI3.Mode=SPI_MODE_MASTER
NVIC.OTG_FS_IRQn=true\:0\:0\:false\:false\:true\:false\:true
ProjectManager.ToolChainLocation=
RCC.LSI_VALUE=32000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
USB_OTG_FS.VirtualMode=Device_Only
PE9.Mode=16b-d1
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Signal=USB_DEVICE_VS_USB_DEVICE_CDC_FS
PC11.Mode=Full_Duplex_Master
PB14.GPIOParameters=GPIO_Label
RCC.APB2CLKDivider=RCC_HCLK_DIV2
PB5.GPIO_Label=HEATER
PD4.Mode=Lcd1
RCC.APB1TimFreq_Value=84000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
SPI3.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate
USB_OTG_FS.IPParameters=VirtualMode
PB10.GPIOParameters=GPIO_Label
PE7.Signal=FSMC_D4
SPI1.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_32
PA4.GPIO_Label=TEMP_CS
PD15.Signal=FSMC_D1
ProjectManager.CustomerFirmwarePackage=
VP_TIM3_VS_ClockSourceINT.Mode=Internal
PB15.Locked=true
PB4.Signal=GPXTI4
PA5.Mode=Full_Duplex_Master
PE12.Mode=16b-d1
NVIC.EXTI4_IRQn=true\:0\:0\:false\:false\:true\:true\:true
ProjectManager.ProjectFileName=F415VG.ioc
PA7.Mode=Full_Duplex_Master
Mcu.PinsNb=49
ProjectManager.NoMain=false
SPI1.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,BaudRatePrescaler
USB_DEVICE.VirtualModeFS=Cdc_FS
PC11.Signal=SPI3_MISO
TIM6.Prescaler=84 - 1
PE10.Mode=16b-d1
PC10.Mode=Full_Duplex_Master
VP_TIM6_VS_ClockSourceINT.Mode=Enable_Timer
PD7.Signal=FSMC_NE1
PD1.Signal=FSMC_D3
ProjectManager.DefaultFWLocation=true
PD5.Signal=FSMC_NWE
PD9.Signal=FSMC_D14
PB12.Locked=true
ProjectManager.DeletePrevious=true
PB14.Locked=true
RCC.APB1CLKDivider=RCC_HCLK_DIV4
PB10.Locked=true
USB_DEVICE.IPParameters=VirtualModeFS,CLASS_NAME_FS,VirtualMode-CDC_FS
RCC.FamilyName=M
PE8.Mode=16b-d1
VP_TIM6_VS_ClockSourceINT.Signal=TIM6_VS_ClockSourceINT
PD10.Signal=FSMC_D15
PA13.Signal=SYS_JTMS-SWDIO
TIM6.IPParameters=Prescaler
VP_TIM4_VS_ClockSourceINT.Signal=TIM4_VS_ClockSourceINT
ProjectManager.TargetToolchain=STM32CubeIDE
TIM4.IPParameters=Prescaler
PB10.GPIO_Label=TOUCH_CS
PB7.GPIOParameters=GPIO_Label
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Mode=CDC_FS
SH.GPXTI12.ConfNb=1
PB5.Locked=true
ProjectManager.RegisterCallBack=
VP_TIM3_VS_ClockSourceINT.Signal=TIM3_VS_ClockSourceINT
TIM4.Prescaler=84 - 1
PE11.Signal=FSMC_D8
RCC.LSE_VALUE=32768
PD8.Mode=16b-d1
Mcu.Pin48=VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS
Mcu.Pin46=VP_TIM4_VS_ClockSourceINT
Mcu.Pin47=VP_TIM6_VS_ClockSourceINT
PB10.Signal=GPIO_Output
RCC.VCOI2SOutputFreq_Value=384000000
PB14.Signal=GPIO_Output
PA5.Signal=SPI1_SCK
Mcu.Pin40=PB5
Mcu.Pin41=PB6
Mcu.Pin44=VP_TIM2_VS_ClockSourceINT
PC12.Mode=Full_Duplex_Master
Mcu.Pin45=VP_TIM3_VS_ClockSourceINT
Mcu.Pin42=PB7
board=custom
Mcu.Pin43=VP_SYS_VS_Systick
RCC.VCOOutputFreq_Value=336000000
ProjectManager.LastFirmware=false
PD1.Mode=16b-d1
NVIC.TIM3_IRQn=true\:0\:0\:false\:false\:true\:true\:true
RCC.APB2Freq_Value=84000000
PE14.Signal=FSMC_D11
SPI3.CalculateBaudRate=21.0 MBits/s
PE15.Signal=FSMC_D12
MxCube.Version=6.2.0
Mcu.Pin37=PD7
PB4.GPIO_Label=ZCD
Mcu.Pin38=PB3
PB15.GPIO_Label=TFT_RST
Mcu.Pin35=PD4
VP_TIM2_VS_ClockSourceINT.Mode=Internal
PE8.Signal=FSMC_D5
Mcu.Pin36=PD5
SPI1.Mode=SPI_MODE_MASTER
Mcu.Pin39=PB4
PE14.Mode=16b-d1
Mcu.Pin30=PC10
VP_SYS_VS_Systick.Mode=SysTick
RCC.EthernetFreq_Value=168000000
Mcu.Pin33=PD0
TIM3.IPParameters=Prescaler
PH1-OSC_OUT.Signal=RCC_OSC_OUT
Mcu.Pin34=PD1
Mcu.Pin31=PC11
Mcu.Pin32=PC12
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA4.GPIOParameters=GPIO_Label
TIM2.Period=0xffffffff
PB15.GPIOParameters=GPIO_Label
PA13.Mode=Trace_Asynchronous_SW
ProjectManager.FreePins=false
RCC.IPParameters=48MHZClocksFreq_Value,AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2CLKDivider,APB2Freq_Value,APB2TimFreq_Value,CortexFreq_Value,EthernetFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,HSI_VALUE,I2SClocksFreq_Value,LSE_VALUE,LSI_VALUE,MCO2PinFreq_Value,PLLCLKFreq_Value,PLLM,PLLN,PLLQ,PLLQCLKFreq_Value,RTCFreq_Value,RTCHSEDivFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VcooutputI2S
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F415VGTx
PD0.Mode=16b-d1
PE12.Signal=FSMC_D9
Mcu.Pin26=PA11
Mcu.Pin27=PA12
RCC.RTCHSEDivFreq_Value=8000000
Mcu.Pin24=PD14
ProjectManager.UnderRoot=true
Mcu.Pin25=PD15
Mcu.IP8=TIM4
Mcu.IP9=TIM6
PD14.Signal=FSMC_D0
Mcu.Pin28=PA13
Mcu.IP6=TIM2
Mcu.Pin29=PA14
Mcu.IP7=TIM3
ProjectManager.CoupleFile=true
PB4.Locked=true
RCC.48MHZClocksFreq_Value=48000000
PB3.Signal=SYS_JTDO-SWO
PA4.Signal=GPIO_Output
RCC.SYSCLKFreq_VALUE=168000000
PE7.Mode=16b-d1
Mcu.Pin22=PD10
PB5.Signal=GPIO_Output
Mcu.Pin23=PD11
Mcu.Pin20=PD8
Mcu.Pin21=PD9
PA12.Mode=Device_Only
SH.GPXTI4.0=GPIO_EXTI4
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
PD11.Signal=FSMC_A16
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.CompilerOptimize=6
PA11.Signal=USB_OTG_FS_DM
PA14.Signal=SYS_JTCK-SWCLK
ProjectManager.HeapSize=0x200
Mcu.Pin15=PB10
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PB12
Mcu.Pin13=PE14
SH.GPXTI4.ConfNb=1
PD11.Mode=A16_1
Mcu.Pin14=PE15
Mcu.Pin19=PB15
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PB13
RCC.HSI_VALUE=16000000
Mcu.Pin18=PB14
VP_TIM4_VS_ClockSourceINT.Mode=Internal
RCC.PLLQ=7
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PE12
Mcu.Pin12=PE13
RCC.PLLM=8
RCC.PLLN=168
Mcu.Pin10=PE11
PB7.Locked=true
NVIC.TIM4_IRQn=true\:0\:0\:false\:false\:true\:true\:true
RCC.APB1Freq_Value=42000000
ProjectManager.DeviceId=STM32F415VGTx
PB12.GPIOParameters=GPIO_Label
PB12.Signal=GPXTI12
ProjectManager.LibraryCopy=1
PE15.Mode=16b-d1
PA7.Signal=SPI1_MOSI
isbadioc=false
